Masmiseim36/nxpSDK/boards/usbkw38/project_template/pin_mux.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: MKW37Z512xxx4
package_id: MKW37Z512VFT4
mcu_data: ksdk2_0
processor_version: 0.0.3
board: USB-KW38
pin_labels:
- {pin_num: '23', pin_signal: ADC0_SE4/CMP0_IN2/PTB18/I2C1_SCL/TPM_CLKIN0/TPM0_CH0/NMI_b, label: 'J4[2]/A1/SW2', identifier: SW2}
- {pin_num: '38', pin_signal: PTC2/LLWU_P10/TX_SWITCH/I2C1_SCL/LPUART0_RX/CMT_IRO/DTM_RX/SPI1_SOUT, label: SW3, identifier: SW3}
- {pin_num: '18', pin_signal: ADC0_SE3/CMP0_IN3/PTB2/RF_NOT_ALLOWED/LLWU_P9/DTM_TX/TPM0_CH0/TPM1_CH0/TPM2_CH0, label: 'J4[3]/Q3[1]/A2/LEDRGB_BLUE', identifier: LED_BLUE}
- {pin_num: '4', pin_signal: PTA16/LLWU_P4/SPI1_SOUT/TPM0_CH0, label: 'J2[1]/Q2[1]/D8/LEDRGB_GREEN', identifier: LED_GREEN}
- {pin_num: '37', pin_signal: PTC1/RF_EARLY_WARNING/ANT_B/I2C0_SDA/LPUART0_RTS_b/TPM0_CH2/SPI1_SCK, label: 'J2[2]/Q1[1]/D9/LEDRGB_RED', identifier: LED_RED}
- {pin_num: '42', pin_signal: PTC6/LLWU_P14/RF_RFOSC_EN/I2C1_SCL/LPUART0_RX/TPM2_CH0, label: 'J8[1]/U4[4]/UART0_RX_TGTMCU', identifier: DEBUG_UART_RX}
- {pin_num: '43', pin_signal: PTC7/LLWU_P15/SPI0_PCS2/I2C1_SDA/LPUART0_TX/TPM2_CH1, label: 'J10[1]/U6[1]/UART0_TX_TGTMCU', identifier: DEBUG_UART_TX}
- {pin_num: '30', pin_signal: EXTAL, label: 'Y1[3]/EXTAL_32M', identifier: EXTAL}
- {pin_num: '31', pin_signal: XTAL, label: 'Y1[1]/XTAL_32M', identifier: XTAL}
- {pin_num: '21', pin_signal: EXTAL32K/PTB16/I2C1_SCL/TPM2_CH0, label: 'Y2[2]/EXTAL32K', identifier: EXTAL32K}
- {pin_num: '22', pin_signal: XTAL32K/PTB17/I2C1_SDA/TPM2_CH1, label: 'Y2[1]/XTAL32K', identifier: XTAL32K}
- {pin_num: '16', pin_signal: PTB0/LLWU_P8/RF_RFOSC_EN/I2C0_SCL/CMP0_OUT/TPM0_CH1/CLKOUT, label: 'J2[10]/U11[4]/D15/I2C_SCL_FXOS8700CQ', identifier: ACCEL_SCL}
- {pin_num: '17', pin_signal: ADC0_SE1/CMP0_IN5/PTB1/RF_PRIORITY/DTM_RX/I2C0_SDA/LPTMR0_ALT1/TPM0_CH2/CMT_IRO, label: 'J2[9]/U11[6]/D14/I2C_SDA_FXOS8700CQ', identifier: ACCEL_SDA}
- {pin_num: '46', pin_signal: PTC17/LLWU_P1/RF_EXT_OSC_EN/SPI0_SOUT/I2C1_SCL/LPUART0_RX/DTM_RX, label: 'J9[1]/U3[1]/SI', identifier: FLASH_SI}
- {pin_num: '45', pin_signal: PTC16/LLWU_P0/RF_STATUS/SPI0_SCK/I2C0_SDA/LPUART0_RTS_b/TPM0_CH3, label: 'J2[6]/U3[2]/D13/SCK', identifier: FLASH_SCK}
- {pin_num: '48', pin_signal: PTC19/LLWU_P3/RF_EARLY_WARNING/SPI0_PCS0/I2C0_SCL/LPUART0_CTS_b, label: 'J1[3]/U3[4]/D2/CS', identifier: FLASH_CS}
- {pin_num: '47', pin_signal: PTC18/LLWU_P2/SPI0_SIN/I2C1_SDA/LPUART0_TX/DTM_TX, label: 'J7[1]/U3[8]/SO', identifier: FLASH_SO}
- {pin_num: '25', pin_signal: ADC0_DM0/CMP0_IN1, label: 'J4[6]/A5/ADC0_DM0/CMP0_IN1/THER_B', identifier: ADC0_DM_THER}
- {pin_num: '24', pin_signal: ADC0_DP0/CMP0_IN0, label: 'J4[1]/A0/ADC0_DP0/CMP0_IN0/THER_A', identifier: ADC0_DP_THER}
- {pin_num: '40', pin_signal: PTC4/LLWU_P12/RF_ACTIVE/ANT_A/EXTRG_IN/LPUART0_CTS_b/TPM1_CH0/I2C0_SCL/SPI1_PCS0, label: 'J1[6]/U19[4]/U17[4]/D5/CAN_RX', identifier: CAN_RX}
- {pin_num: '39', pin_signal: PTC3/LLWU_P11/RX_SWITCH/I2C1_SDA/LPUART0_TX/TPM0_CH1/DTM_TX/SPI1_SIN, label: 'J1[4]/U19[1]/U20[4]/D3/CAN_TX', identifier: CAN_TX}
- {pin_num: '5', pin_signal: PTA17/LLWU_P5/SPI1_SIN/TPM_CLKIN1, label: 'J1[5]/U10[1]/U12[3]/D4/LIN_RX_LS', identifier: LIN_RX_LS}
- {pin_num: '6', pin_signal: PTA18/LLWU_P6/SPI1_SCK/TPM2_CH0, label: 'J1[7]/U7[5]/U10[4]/D6/LIN_TX_LS', identifier: LIN_TX_LS}
- {pin_num: '41', pin_signal: PTC5/LLWU_P13/RF_NOT_ALLOWED/RF_PRIORITY/LPTMR0_ALT2/LPUART0_RTS_b/TPM1_CH1, label: 'J1[8]/U7[1]/U10[2]/D7/LIN_SLP', identifier: LIN_SLP}
- {pin_num: '1', pin_signal: PTA0/RF_ACTIVE/SPI0_PCS1/TPM1_CH0/SWD_DIO, label: 'J12[2]/J16[2]/SWD_DIO'}
- {pin_num: '2', pin_signal: PTA1/RF_STATUS/SPI1_PCS0/TPM1_CH1/SWD_CLK, label: 'J15[1]/SWD_CLK'}
- {pin_num: '8', pin_signal: PSWITCH, label: 'J38[2]/PSWITCH'}
- {pin_num: '3', pin_signal: PTA2/TPM0_CH3/RESET_b, label: 'J3[3]/J5[3]/J12[10]/RST_TGTMCU_b'}
- {pin_num: '7', pin_signal: ADC0_SE5/PTA19/LLWU_P7/SPI1_PCS0/TPM2_CH1, label: 'J2[3]/U11[11]/D10/INT1_COMBO', identifier: ACCEL_INT1}
- {pin_num: '9', pin_signal: DCDC_CFG/VDCDC_IN, label: 'J27[2]/J30[1]/VDCDC_IN/SW4'}
- {pin_num: '10', pin_signal: DCDC_LP, label: 'L3[1]/DCDC_LP'}
- {pin_num: '12', pin_signal: DCDC_LN12, label: 'L3[2]/DCDC_LN'}
- {pin_num: '11', pin_signal: DCDC_GND, label: GND}
- {pin_num: '26', pin_signal: VREFL/VSSA, label: GND}
- {pin_num: '13', pin_signal: VDD_1P8OUT, label: 'J27[1]/J29[1]/VDD_1P8'}
- {pin_num: '15', pin_signal: VDD_1P5OUT_PMCIN, label: 'J31[1]/L5[1]/C66/VDD_RFF/VDD_1P45OUT_PMCIN'}
- {pin_num: '19', pin_signal: ADC0_SE2/CMP0_IN4/PTB3/ERCLK32K/RF_ACTIVE/TPM0_CH1/CLKOUT/TPM1_CH1/RTC_CLKOUT/TPM2_CH1, label: 'J4[4]/Q4[1]/A3/LED3', identifier: LED_COMMUNICATING;LED_COMM;LED3_RED}
- {pin_num: '20', pin_signal: VDD_0, label: 'J29[2]/VDD_MCU'}
- {pin_num: '44', pin_signal: VDD_1, label: 'J29[2]/VDD_MCU'}
- {pin_num: '27', pin_signal: VREFH/VREF_OUT, label: C60}
- {pin_num: '28', pin_signal: VDDA, label: 'L4[2]/C69/VDDA'}
- {pin_num: '29', pin_signal: XTAL_OUT, label: 'J33[2]/XTAL_OUT'}
- {pin_num: '32', pin_signal: VDD_RF3, label: 'J31[2]/VDD_RF'}
- {pin_num: '33', pin_signal: ANT, label: 'J21[1]/L2[1]/RF_SMA/RF_50/RF_ANT'}
- {pin_num: '34', pin_signal: GANT, label: GND}
- {pin_num: '35', pin_signal: VDD_RF2, label: 'J31[2]/VDD_RF'}
- {pin_num: '36', pin_signal: VDD_RF1, label: 'J31[2]/VDD_RF'}
- {pin_num: '14', pin_signal: DCDC_LN14, label: 'L3[2]/DCDC_LN'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

